Documents/ПодготовкаСпецоценкиУсловийТруда.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ПодготовкаСпецоценкиУсловийТруда</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Руководитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДолжностьРуководителя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеПодписиРуководителя</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеПодписи</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйЗаОхрануТруда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДолжностьОтветственногоЗаОхрануТруда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеПодписиОтветственногоЗаОхрануТруда</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеПодписи</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РабочиеМеста</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>РабочееМесто</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РабочиеМестаОхраныТруда</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Должности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьРабочееМесто</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ШтатноеРасписание</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьПредставлениеРабочегоМеста</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлассУсловийТрудаПоРезультатамПредыдущейОценки</Name>
							<Type>
								<v8:Type>cfg:EnumRef.КлассыУсловийТрудаПоРезультатамСпециальнойОценки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПредыдущейОценки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Примечание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтрокиРабочегоМеста</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>АналогичныеМеста</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>УдалитьРабочееМесто</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ШтатноеРасписание</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьАналогичноеМесто</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.УсловияТруда</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АналогичноеМесто</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РабочиеМестаОхраныТруда</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтрокиРабочегоМеста</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Сотрудники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>УдалитьРабочееМесто</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ШтатноеРасписание</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РабочееМесто</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РабочиеМестаОхраныТруда</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтраховойНомерПФР</Name>
							<Comment>АПК:58 различия имени и синонима оправданы</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>14</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пол</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ПолФизическогоЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаРождения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Инвалидность</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтрокиРабочегоМеста</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Комиссия</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЧленКомиссии</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Должности</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РольВКомиссии</Name>
							<Type>
								<v8:Type>cfg:EnumRef.РолиЧленовКомиссииОхраныТруда</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ФизическиеЛица</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизическоеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/РезультатыСпециальнойОценкиУсловийТруда.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>РезультатыСпециальнойОценкиУсловийТруда</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КлассУсловийТруда</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КлассыУсловийТрудаПоРезультатамСпециальнойОценки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>РабочееМесто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РабочиеМестаОхраныТруда</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/РолиЧленовКомиссииОхраныТруда.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>РолиЧленовКомиссииОхраныТруда</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Председатель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧленКомиссии</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ПодготовкаСпецоценкиУсловийТруда/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// ЗарплатаКадрыПодсистемы.ПодписиДокументов
	ПодписиДокументов.ПриСозданииНаСервере(ЭтотОбъект, Документы.ПодготовкаСпецоценкиУсловийТруда.ОписаниеПодписейДокумента());
	// Конец ЗарплатаКадрыПодсистемы.ПодписиДокументов
	
	Если Параметры.Ключ.Пустая() Тогда
		
		// Создается новый документ.
		ЗначенияДляЗаполнения = Новый Структура("Организация, Ответственный", "Объект.Организация", "Объект.Ответственный");
		ЗарплатаКадры.ЗаполнитьПервоначальныеЗначенияВФорме(ЭтаФорма, ЗначенияДляЗаполнения);
		
		ЗаполнитьДанныеФормыПоОрганизации();
		ПриПолученииДанныхНаСервере();
		
		ЗарплатаКадры.КлючевыеРеквизитыЗаполненияФормыЗаполнитьПредупреждения(ЭтаФорма);
		ЗарплатаКадрыКлиентСервер.КлючевыеРеквизитыЗаполненияФормыУстановитьОтображениеПредупреждения(ЭтаФорма);
	
	КонецЕсли;
	
	// Обработчик подсистемы "ВерсионированиеОбъектов"
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства
	
	// ПроцессыОбработкиДокументов
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ПроцессыОбработкиДокументовЗарплата") Тогда
		МодульПроцессыОбработкиДокументовЗарплата = ОбщегоНазначения.ОбщийМодуль("ПроцессыОбработкиДокументовЗарплата");
		МодульПроцессыОбработкиДокументовЗарплата.ПриСозданииНаСервере(ЭтотОбъект, Объект);
	КонецЕсли;	
	// Конец ПроцессыОбработкиДокументов
	
	УстановитьУсловноеОформление();
	
	// ИнтеграцияС1СДокументооборотом
	Если ОбщегоНазначения.ПодсистемаСуществует("ИнтеграцияС1СДокументооборотом") Тогда
		МодульИнтеграцияС1СДокументооборотБазоваяФункциональность = ОбщегоНазначения.ОбщийМодуль(
			"ИнтеграцияС1СДокументооборотБазоваяФункциональность");
		МодульИнтеграцияС1СДокументооборотБазоваяФункциональность.ПриСозданииНаСервере(ЭтотОбъект);
	КонецЕсли;
	// Конец ИнтеграцияС1СДокументооборотом
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ПриПолученииДанныхНаСервере();
	ОбновитьКраткиеСоставы();
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
		
	// ПроцессыОбработкиДокументов
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ПроцессыОбработкиДокументовЗарплата") Тогда
		МодульПроцессыОбработкиДокументовЗарплата = ОбщегоНазначения.ОбщийМодуль("ПроцессыОбработкиДокументовЗарплата");
		МодульПроцессыОбработкиДокументовЗарплата.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;	
	// Конец ПроцессыОбработкиДокументов
	
	ЗарплатаКадры.КлючевыеРеквизитыЗаполненияФормыЗаполнитьПредупреждения(ЭтаФорма);
	ЗарплатаКадрыКлиентСервер.КлючевыеРеквизитыЗаполненияФормыУстановитьОтображениеПредупреждения(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("Запись_ПодготовкаСпецоценкиУсловийТруда", ПараметрыЗаписи, Объект.Ссылка);
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// ЗарплатаКадрыПодсистемы.ПодписиДокументов
	ПодписиДокументов.ПослеЗаписиНаСервере(ЭтотОбъект);
	// Конец ЗарплатаКадрыПодсистемы.ПодписиДокументов
	
	ПриПолученииДанныхНаСервере();
	ОбновитьКраткиеСоставы();
	
	// ПроцессыОбработкиДокументов
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ПроцессыОбработкиДокументовЗарплата") Тогда
		МодульПроцессыОбработкиДокументовЗарплата = ОбщегоНазначения.ОбщийМодуль("ПроцессыОбработкиДокументовЗарплата");
		МодульПроцессыОбработкиДокументовЗарплата.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	КонецЕсли;	
	// Конец ПроцессыОбработкиДокументов
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	// ПроцессыОбработкиДокументов
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ПроцессыОбработкиДокументовЗарплата") Тогда
		МодульПроцессыОбработкиДокументовЗарплата = ОбщегоНазначенияКлиент.ОбщийМодуль("ПроцессыОбработкиДокументовЗарплатаКлиент");
		МодульПроцессыОбработкиДокументовЗарплата.ПередЗакрытием(ЭтотОбъект, Объект, Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	КонецЕсли;	
	// Конец ПроцессыОбработкиДокументов
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// СтандартныеПодсистемы.Свойства
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры
	
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.ЗаполнитьАналогичныеРабочиеМеста(ИдентификаторыРабочихМест());
	ТекущийОбъект.ЗаполнитьСотрудников(ИдентификаторСотрудников());
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// ПроцессыОбработкиДокументов
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ПроцессыОбработкиДокументовЗарплата") Тогда
		МодульПроцессыОбработкиДокументовЗарплата = ОбщегоНазначения.ОбщийМодуль("ПроцессыОбработкиДокументовЗарплата");
		МодульПроцессыОбработкиДокументовЗарплата.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи, Отказ);
	КонецЕсли;		
	// Конец ПроцессыОбработкиДокументов
	
	// ИнтеграцияС1СДокументооборотом
	Если ОбщегоНазначения.ПодсистемаСуществует("ИнтеграцияС1СДокументооборотом") Тогда
		МодульИнтеграцияС1СДокументооборотБазоваяФункциональность = ОбщегоНазначения.ОбщийМодуль(
			"ИнтеграцияС1СДокументооборотБазоваяФункциональность");
		МодульИнтеграцияС1СДокументооборотБазоваяФункциональность.ПередЗаписьюНаСервере(
			ЭтотОбъект,
			ТекущийОбъект,
			ПараметрыЗаписи);
	КонецЕсли;
	// Конец ИнтеграцияС1СДокументооборотом
	
КонецПроцедуры
	
&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
	
	ТекущийОбъект = РеквизитФормыВЗначение("Объект");
	ТекущийОбъект.ЗаполнитьАналогичныеРабочиеМеста(ИдентификаторыРабочихМест());
	ТекущийОбъект.ЗаполнитьСотрудников(ИдентификаторСотрудников());
	Если НЕ ТекущийОбъект.ПроверитьЗаполнение() Тогда
		Отказ = Истина
	КонецЕсли;	
	ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(ПроверяемыеРеквизиты, "Объект");
	
КонецПроцедуры
	
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ЗарплатаКадрыКлиент.КлючевыеРеквизитыЗаполненияФормыОчиститьТаблицы(ЭтаФорма);
	ОрганизацияПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
	ЗарплатаКадрыКлиент.КлючевыеРеквизитыЗаполненияФормыОчиститьТаблицы(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	ЗаполнитьДанныеФормыПоОрганизации();
КонецПроцедуры

#Область ОбработчикиПодсистемыПодписиДокументов

&НаКлиенте
Процедура Подключаемый_ПодписиДокументовЭлементПриИзменении(Элемент)
	ПодписиДокументовКлиент.ПриИзмененииПодписывающегоЛица(ЭтотОбъект, Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПодписиДокументовЭлементНажатие(Элемент)
	ПодписиДокументовКлиент.РасширеннаяПодсказкаНажатие(ЭтотОбъект, Элемент.Имя);
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыРабочиеМеста

&НаКлиенте
Процедура РабочиеМестаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Поле.Имя = "РабочиеМестаКомандаАналогичныеМеста" Тогда
		
		СтандартнаяОбработка = Ложь;
		ОткрытьФормуАналогичныхРабочихМестПоСтроке(ТекущиеДанные, Истина);
		
	ИначеЕсли Поле.Имя = "РабочиеМестаКомандаСотрудники" Тогда
		
		СтандартнаяОбработка = Ложь;
		ПараметрыОткрытия = Новый Структура;
		МассивСотрудников = Новый Массив;
		Для Каждого ДанныеСотрудника Из ТекущиеДанные.МассивСотрудников Цикл
			МассивСотрудников.Добавить(ДанныеСотрудника.Сотрудник);
		КонецЦикла;
		ПараметрыОткрытия.Вставить("Сотрудники", МассивСотрудников);
		ПараметрыОткрытия.Вставить("РабочееМесто", ТекущиеДанные.РабочееМесто);
		
		ОткрытьФорму("Документ.ПодготовкаСпецоценкиУсловийТруда.Форма.ФормаСотрудников",
			ПараметрыОткрытия, ЭтотОбъект, , , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РабочиеМестаПередУдалением(Элемент, Отказ)
	
	Если Элемент.ТекущиеДанные = Неопределено Тогда
		Возврат
	КонецЕсли;
	
	// вроде лишняя процедура (в назначении и в результатах тоже осталась)
	РабочиеМестаПередУдалениемНаСервере(Элемент.ТекущиеДанные.ИдентификаторСтрокиРабочегоМеста);
	
КонецПроцедуры

&НаКлиенте
Процедура РабочиеМестаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	РабочиеМестаОбработкаВыбораНаСервере(ВыбранноеЗначение);
КонецПроцедуры

&НаКлиенте
Процедура РабочиеМестаРабочееМестоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.РабочиеМеста.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	РабочиеМестаРабочееМестоПриИзмененииНаСервере(ТекущиеДанные.ПолучитьИдентификатор());
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыКомиссия

&НаКлиенте
Процедура КомиссияПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если НоваяСтрока И Не Копирование Тогда
		ТекущиеДанные.РольВКомиссии = ПредопределенноеЗначение("Перечисление.РолиЧленовКомиссииОхраныТруда.ЧленКомиссии");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомиссияЧленКомиссииПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Комиссия.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекущиеДанные.ЧленКомиссии) Тогда
		ТекущиеДанные.Должность = ДолжностьЧленаКомиссии(ТекущиеДанные.ЧленКомиссии);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.Свойства
&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

#Область ОбработчикиСобытийПроцессыОбработкиДокументов

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокумента(Команда)
	// ПроцессыОбработкиДокументов
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ПроцессыОбработкиДокументовЗарплата") Тогда
		МодульПроцессыОбработкиДокументовЗарплата = ОбщегоНазначенияКлиент.ОбщийМодуль("ПроцессыОбработкиДокументовЗарплатаКлиент");
		МодульПроцессыОбработкиДокументовЗарплата.ВыполнитьЗадачу(ЭтотОбъект, Команда, Объект)
	КонецЕсли;		
	// Конец ПроцессыОбработкиДокументов
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокументаОповещение(Контекст, ДополнительныеПараметры) Экспорт
	ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст);
	ВыполнитьОбработкуОповещения(ДополнительныеПараметры, Контекст);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст)
	// ПроцессыОбработкиДокументов
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ПроцессыОбработкиДокументовЗарплата") Тогда	
		МодульПроцессыОбработкиДокументовЗарплата = ОбщегоНазначения.ОбщийМодуль("ПроцессыОбработкиДокументовЗарплата");
		МодульПроцессыОбработкиДокументовЗарплата.ВыполнитьЗадачу(ЭтотОбъект, Контекст, Объект);
	КонецЕсли;		
	// Конец ПроцессыОбработкиДокументов
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийНаправившегоОткрытие(Элемент, СтандартнаяОбработка)
	// ПроцессыОбработкиДокументов
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ПроцессыОбработкиДокументовЗарплата") Тогда	
		МодульПроцессыОбработкиДокументовЗарплата = ОбщегоНазначенияКлиент.ОбщийМодуль("ПроцессыОбработкиДокументовЗарплатаКлиент");
		МодульПроцессыОбработкиДокументовЗарплата.КомментарийНаправившегоОткрытие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
	КонецЕсли;		
	// Конец ПроцессыОбработкиДокументов
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийСледующемуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	// ПроцессыОбработкиДокументов
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ПроцессыОбработкиДокументовЗарплата") Тогда	
		МодульПроцессыОбработкиДокументовЗарплата = ОбщегоНазначенияКлиент.ОбщийМодуль("ПроцессыОбработкиДокументовЗарплатаКлиент");
		МодульПроцессыОбработкиДокументовЗарплата.КомментарийСледующемуНачалоВыбора(ЭтотОбъект, Элемент, ДанныеВыбора, СтандартнаяОбработка);
	КонецЕсли;		
	// Конец ПроцессыОбработкиДокументов
КонецПроцедуры

#КонецОбласти

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура Подбор(Команда)
	
	Отказ = Ложь;
	
	Если Не ЗначениеЗаполнено(Объект.ДатаНачала) Тогда
		ТекстСообщения = НСтр("ru = 'Не указана дата начала.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения, , "Объект.ДатаНачала", , Отказ);
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	КадровыйУчетКлиент.ВыбратьСотрудниковРаботающихВПериодеПоПараметрамОткрытияФормыСписка(
		Элементы.РабочиеМеста,
		Объект.Организация,
		Объект.Подразделение,
		Объект.ДатаНачала,
		Объект.ДатаОкончания,
		,
		АдресСпискаПодобранныхСотрудников());
	
КонецПроцедуры

&НаКлиенте
Процедура ВыделитьАналогичныеРабочиеМеста(Команда)
	
	ОсновноеРабочееМесто = Неопределено;
	
	ВыделенныеСтроки = Элементы.РабочиеМеста.ВыделенныеСтроки;
	КоличествоСтрок = ВыделенныеСтроки.Количество();
	
	Если КоличествоСтрок = 0 Тогда
		Возврат;
	КонецЕсли;
	
	МассивАналогичныеМеста = Новый Массив;
	Если КоличествоСтрок = 1 Тогда
		СтрокаТаблицы = Объект.РабочиеМеста.НайтиПоИдентификатору(ВыделенныеСтроки[0]);
		ОткрытьФормуАналогичныхРабочихМестПоСтроке(СтрокаТаблицы);
		Возврат;
	Иначе
		СоответствиеПодразделений = Новый Соответствие;
		СоответствиеДолжностей = Новый Соответствие;
		
		Для Каждого ВыделеннаяСтрока Из ВыделенныеСтроки Цикл
			СтрокаТаблицы = Объект.РабочиеМеста.НайтиПоИдентификатору(ВыделеннаяСтрока);
			Если СтрокаТаблицы <> Неопределено Тогда 
				Если Не ЗначениеЗаполнено(СтрокаТаблицы.РабочееМесто) Тогда
					Продолжить;
				КонецЕсли;
				МассивАналогичныеМеста.Добавить(СтрокаТаблицы.РабочееМесто);
				Для Каждого РабочееМесто Из СтрокаТаблицы.МассивАналогичныхРабочихМест Цикл
					Если ОсновноеРабочееМесто = Неопределено Тогда
						ОсновноеРабочееМесто = СтрокаТаблицы.РабочееМесто;
					КонецЕсли;
					МассивАналогичныеМеста.Добавить(РабочееМесто);
				КонецЦикла;
				СоответствиеПодразделений.Вставить(СтрокаТаблицы.Подразделение,"");
				СоответствиеДолжностей.Вставить(СтрокаТаблицы.Должность,"");
			КонецЕсли;
		КонецЦикла;
		Если СоответствиеПодразделений.Количество() > 1 Тогда
			ВызватьИсключение НСтр("ru = 'Не удалось выделить аналогичные рабочие места: выберите строки с одинаковыми подразделениями.'");
		ИначеЕсли СоответствиеДолжностей.Количество() > 1 Тогда
			ВызватьИсключение НСтр("ru = 'Не удалось выделить аналогичные рабочие места: выберите строки с одинаковыми должностями.'");
		КонецЕсли;
	КонецЕсли;
	
	МассивРабочиеМеста = Новый Массив;
	ПараметрыОтбора = Новый Структура("Должность, Подразделение", СтрокаТаблицы.Должность, СтрокаТаблицы.Подразделение);
	Для Каждого СтрокаРабочиеМеста Из Объект.РабочиеМеста.НайтиСтроки(ПараметрыОтбора) Цикл
		Если Не ЗначениеЗаполнено(СтрокаРабочиеМеста.РабочееМесто) Тогда
			Продолжить;
		КонецЕсли;
		МассивРабочиеМеста.Добавить(Новый Структура("РабочееМесто", СтрокаРабочиеМеста.РабочееМесто));
	КонецЦикла;
	
	ПараметрыОткрытия = Новый Структура;
	Если МассивАналогичныеМеста.Количество() > 0 Тогда
		ПараметрыОткрытия.Вставить("ОсновноеРабочееМесто", ?(ОсновноеРабочееМесто = Неопределено, МассивАналогичныеМеста[0], ОсновноеРабочееМесто));
	КонецЕсли;
	ПараметрыОткрытия.Вставить("АналогичныеМеста", ОбщегоНазначенияКлиентСервер.СвернутьМассив(МассивАналогичныеМеста));
	ПараметрыОткрытия.Вставить("РабочиеМеста", МассивРабочиеМеста);
	
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ВыделитьАналогичныеРабочиеМестаПослеЗакрытия", ЭтотОбъект);
	ОткрытьФорму("Документ.ПодготовкаСпецоценкиУсловийТруда.Форма.ФормаАналогичныхМест",
		ПараметрыОткрытия, ЭтотОбъект, , , , ОповещениеОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыделитьАналогичныеРабочиеМестаПослеЗакрытия(РезультатЗакрытия, ДополнительныеПараметры) Экспорт 
	
	Если ТипЗнч(РезультатЗакрытия) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	ВыделитьАналогичныеРабочиеМестаПослеЗакрытияНаСервере(РезультатЗакрытия, ДополнительныеПараметры);
	
КонецПроцедуры

&НаСервере
Процедура ВыделитьАналогичныеРабочиеМестаПослеЗакрытияНаСервере(РезультатЗакрытия, ДополнительныеПараметры)
	
	ОсновноеРабочееМесто = РезультатЗакрытия.ОсновноеРабочееМесто;
	ПрежнееРабочееМесто = РезультатЗакрытия.ПрежнееРабочееМесто;
	ЕстьАналогичныеМеста = РезультатЗакрытия.АналогичныеМеста.Количество() > 0;
	
	Если ПрежнееРабочееМесто <> ОсновноеРабочееМесто И ЕстьАналогичныеМеста Тогда
		// Очистим аналогичные рабочие места у прежнего основного рабочего места
		НайденныеСтроки = Объект.РабочиеМеста.НайтиСтроки(Новый Структура("РабочееМесто", ПрежнееРабочееМесто));
		Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			Объект.РабочиеМеста.Удалить(НайденнаяСтрока);
		КонецЦикла;
	КонецЕсли;
	
	НайденныеСтрокиОсновногоМеста = Объект.РабочиеМеста.НайтиСтроки(Новый Структура("РабочееМесто", ОсновноеРабочееМесто));
	Если НайденныеСтрокиОсновногоМеста.Количество() = 0 Тогда
		// Заменим предыдущее основное рабочее место текущим
		НайденныеСтрокиОсновногоМеста = Объект.РабочиеМеста.НайтиСтроки(Новый Структура("РабочееМесто", ПрежнееРабочееМесто));
	КонецЕсли;
	
	Если ЕстьАналогичныеМеста Тогда
		Если НайденныеСтрокиОсновногоМеста.Количество() = 0 Тогда
			ОсновнаяСтрока = Объект.РабочиеМеста.Добавить();
			ОсновнаяСтрока.РабочееМесто = ОсновноеРабочееМесто;
			МаксимальныйИдентификаторСтрокиРабочегоМеста = МаксимальныйИдентификаторСтрокиРабочегоМеста + 1;
			ОсновнаяСтрока.ИдентификаторСтрокиРабочегоМеста = МаксимальныйИдентификаторСтрокиРабочегоМеста;
			ОсновнаяСтрока.МассивАналогичныхРабочихМест = Новый ФиксированныйМассив(Новый Массив());
			РабочиеМестаРабочееМестоПриИзмененииНаСервере(Неопределено, ОсновнаяСтрока);
		Иначе
			Для Каждого ОсновнаяСтрока Из НайденныеСтрокиОсновногоМеста Цикл
				ОсновнаяСтрока.РабочееМесто = ОсновноеРабочееМесто;
				РабочиеМестаРабочееМестоПриИзмененииНаСервере(Неопределено, ОсновнаяСтрока, Истина);
			КонецЦикла;
		КонецЕсли;
		
		МассивАналогичныхРабочихМестПриемник = Новый Массив(ОсновнаяСтрока.МассивАналогичныхРабочихМест);
		
		Для Каждого АналогичноеРабочееМесто Из РезультатЗакрытия.АналогичныеМеста Цикл
			// Если аналогичное место было основным, то его нужно заменить на основное рабочее место.
			НайденныеСтроки = Объект.РабочиеМеста.НайтиСтроки(Новый Структура("РабочееМесто", АналогичноеРабочееМесто));
			Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
				Для Каждого ДанныеСотрудника Из НайденнаяСтрока.МассивСотрудников Цикл
					ДополнитьМассивСотрудников(ОсновнаяСтрока, ДанныеСотрудника);
				КонецЦикла;
				Объект.РабочиеМеста.Удалить(НайденнаяСтрока);
			КонецЦикла;
			ОбщегоНазначенияКлиентСервер.ДополнитьМассив(
				МассивАналогичныхРабочихМестПриемник,
				ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(АналогичноеРабочееМесто),
				Истина);
		КонецЦикла;
		
		ОсновнаяСтрока.МассивАналогичныхРабочихМест = Новый ФиксированныйМассив(МассивАналогичныхРабочихМестПриемник);
		ЗаполнитьКраткийСоставАналогичныхМест(ОсновнаяСтрока);
		ЗаполнитьКраткийСоставСотрудников(ОсновнаяСтрока);
	Иначе
		Для Каждого НайденнаяСтрока Из НайденныеСтрокиОсновногоМеста Цикл
			НайденнаяСтрока.МассивАналогичныхРабочихМест = Новый ФиксированныйМассив(Новый Массив());
			РабочиеМестаРабочееМестоПриИзмененииНаСервере(Неопределено, НайденнаяСтрока);
		КонецЦикла;
	КонецЕсли;
	
	Для каждого РабочееМесто Из РезультатЗакрытия.РабочиеМеста Цикл
		// Если нет рабочего места, значит оно было удалено из аналогичных рабочих мест
		// Такое рабочее место нужно вернуть в список рабочих мест.
		НайденныеСтроки = Объект.РабочиеМеста.НайтиСтроки(Новый Структура("РабочееМесто", РабочееМесто));
		Если НайденныеСтроки.Количество() = 0 Тогда
			
			НоваяСтрока = Объект.РабочиеМеста.Добавить();
			МаксимальныйИдентификаторСтрокиРабочегоМеста = МаксимальныйИдентификаторСтрокиРабочегоМеста + 1;
			НоваяСтрока.ИдентификаторСтрокиРабочегоМеста = МаксимальныйИдентификаторСтрокиРабочегоМеста;
			НоваяСтрока.МассивАналогичныхРабочихМест = Новый ФиксированныйМассив(Новый Массив());
			НоваяСтрока.РабочееМесто = РабочееМесто;
			РабочиеМестаРабочееМестоПриИзмененииНаСервере(Неопределено, НоваяСтрока);
			
		КонецЕсли;
	КонецЦикла;
	
	Модифицированность = Истина;
	
КонецПроцедуры

// ИнтеграцияС1СДокументооборотом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграции(Команда)
	
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("ИнтеграцияС1СДокументооборотом") Тогда
		МодульИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль(
			"ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент");
		МодульИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ВыполнитьПодключаемуюКомандуИнтеграции(
			Команда,
			ЭтотОбъект,
			Объект);
	КонецЕсли;
	
КонецПроцедуры
// Конец ИнтеграцияС1СДокументооборотом

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// СтандартныеПодсистемы.Свойства 
&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

&НаСервере
Функция ИдентификаторыРабочихМест()
	
	ИдентификаторыРабочихМест = Новый Соответствие;
	
	Для Каждого РабочееМесто Из Объект.РабочиеМеста Цикл
		ИдентификаторыРабочихМест.Вставить(РабочееМесто.ИдентификаторСтрокиРабочегоМеста, РабочееМесто.МассивАналогичныхРабочихМест);
	КонецЦикла;
	
	Возврат ИдентификаторыРабочихМест
	
КонецФункции

&НаСервере
Функция ИдентификаторСотрудников()
	
	ИдентификаторСотрудников = Новый Соответствие;
	
	Для Каждого РабочееМесто Из Объект.РабочиеМеста Цикл
		ИдентификаторСотрудников.Вставить(РабочееМесто.ИдентификаторСтрокиРабочегоМеста, РабочееМесто.МассивСотрудников);
	КонецЦикла;
	
	Возврат ИдентификаторСотрудников
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция МассивАналогичныхМест(СтрокаРабочегоМеста)
	
	Если СтрокаРабочегоМеста.МассивАналогичныхРабочихМест = Неопределено Тогда
		МассивАналогичныеМеста = Новый Массив();
	Иначе
		МассивАналогичныеМеста = Новый Массив(СтрокаРабочегоМеста.МассивАналогичныхРабочихМест);
	КонецЕсли;
	// Добавим текущее рабочее место в аналогичные места
	МассивАналогичныеМеста.Добавить(СтрокаРабочегоМеста.РабочееМесто);
	
	Возврат МассивАналогичныеМеста;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьКраткийСоставСотрудников(СтрокаРабочегоМеста)
	
	Если СтрокаРабочегоМеста.МассивСотрудников = Неопределено Тогда
		СтрокаРабочегоМеста.КомандаСотрудники = "";
	Иначе
		СтрокаРабочегоМеста.КомандаСотрудники = КраткийСоставСотрудников(СтрокаРабочегоМеста.МассивСотрудников, Объект.Дата);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКраткийСоставАналогичныхМест(СтрокаРабочегоМеста)
	
	АналогичныеМеста = МассивАналогичныхМест(СтрокаРабочегоМеста);
	Если АналогичныеМеста.Количество() = 1 Тогда
		СтрокаРабочегоМеста.КомандаАналогичныеМеста = "";
		Возврат;
	КонецЕсли;
	
	МаксимальнаяДлинаСтроки = 100;
	КраткийСостав = "";
	Для Каждого ЭлементМассива Из АналогичныеМеста Цикл
		Если Не ПустаяСтрока(КраткийСостав) Тогда
			КраткийСостав = КраткийСостав + ", ";
		КонецЕсли;
		КраткийСостав = КраткийСостав + Строка(ЭлементМассива);
		Если СтрДлина(КраткийСостав) > МаксимальнаяДлинаСтроки Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Если СтрДлина(КраткийСостав) > МаксимальнаяДлинаСтроки Тогда
		КраткийСостав = Лев(КраткийСостав, МаксимальнаяДлинаСтроки - 3) + "...";
	КонецЕсли;
	СтрокаРабочегоМеста.КомандаАналогичныеМеста = КраткийСостав;
	
КонецПроцедуры

&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере()
	
	ЗаполнитьДанныеФормыПоОрганизации();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеФормыПоОрганизации()
	
	Если НЕ ЗначениеЗаполнено(Объект.Организация) Тогда
		Возврат;
	КонецЕсли;
	
	// ЗарплатаКадрыПодсистемы.ПодписиДокументов
	ПодписиДокументов.ЗаполнитьПодписиПоОрганизации(ЭтотОбъект);
	// Конец ЗарплатаКадрыПодсистемы.ПодписиДокументов
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()
	
	ЗаполнитьПереченьРабочихМест();
	
	Объект.РабочиеМеста.Сортировать("Подразделение,Должность");
	
КонецПроцедуры

&НаСервере
Процедура ПриПолученииДанныхНаСервере()
	
	МаксимальныйИдентификаторСтрокиРабочегоМеста = ЗарплатаКадрыРасширенный.МаксимальныйИдентификаторСтроки(
		Объект.РабочиеМеста, "ИдентификаторСтрокиРабочегоМеста");
	
	Для Каждого СтрокаРабочегоМеста Из Объект.РабочиеМеста Цикл
		ЗаполнитьМассивАналогичныхРабочихМест(СтрокаРабочегоМеста);
		ЗаполнитьМассивСотрудников(СтрокаРабочегоМеста);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьКраткиеСоставы()
	
	// Заполним текст команд таблицы "Рабочие места"
	Для каждого СтрокаРабочегоМеста Из Объект.РабочиеМеста Цикл
		ЗаполнитьКраткийСоставАналогичныхМест(СтрокаРабочегоМеста);
		ЗаполнитьКраткийСоставСотрудников(СтрокаРабочегоМеста);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПереченьРабочихМест()
	
	РезультатыЗапроса = ОхранаТруда.ДанныеПоРабочимМестам(Объект.Организация, Объект.ДатаНачала, Объект.ДатаОкончания, Объект.Подразделение);
	
	Объект.РабочиеМеста.Очистить();
	Объект.АналогичныеМеста.Очистить();
	МаксимальныйИдентификаторСтрокиРабочегоМеста = 0;
	
	Сотрудники = РезультатыЗапроса.Получить(РезультатыЗапроса.ВГраница()).Выгрузить();
	
	Выборка = РезультатыЗапроса.Получить(РезультатыЗапроса.ВГраница() - 1).Выбрать();
	Пока Выборка.СледующийПоЗначениюПоля("Подразделение") Цикл
		Пока Выборка.СледующийПоЗначениюПоля("Должность") Цикл
			Пока Выборка.СледующийПоЗначениюПоля("РабочееМесто") Цикл
				НоваяСтрока = Объект.РабочиеМеста.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
				МаксимальныйИдентификаторСтрокиРабочегоМеста = МаксимальныйИдентификаторСтрокиРабочегоМеста + 1;
				НоваяСтрока.ИдентификаторСтрокиРабочегоМеста = МаксимальныйИдентификаторСтрокиРабочегоМеста;
				НоваяСтрока.МассивСотрудников = Новый ФиксированныйМассив(Новый Массив());
				НайденныеСотрудники = Сотрудники.НайтиСтроки(Новый Структура("РабочееМесто", Выборка.РабочееМесто));
				Для Каждого НайденныйСотрудник Из НайденныеСотрудники Цикл
					ДополнитьМассивСотрудников(НоваяСтрока, НайденныйСотрудник);
				КонецЦикла;
				МассивАналогичныхМестПриемник = Новый Массив();
				Пока Выборка.Следующий() Цикл
					Если ЗначениеЗаполнено(Выборка.АналогичноеМесто) Тогда
						МассивАналогичныхМестПриемник.Добавить(Выборка.АналогичноеМесто);
						НайденныеСотрудники = Сотрудники.НайтиСтроки(Новый Структура("РабочееМесто", Выборка.АналогичноеМесто));
						Для Каждого НайденныйСотрудник Из НайденныеСотрудники Цикл
							ДополнитьМассивСотрудников(НоваяСтрока, НайденныйСотрудник);
						КонецЦикла;
					КонецЕсли;
				КонецЦикла;
				НоваяСтрока.МассивАналогичныхРабочихМест = Новый ФиксированныйМассив(МассивАналогичныхМестПриемник);
				ЗаполнитьКраткийСоставАналогичныхМест(НоваяСтрока);
				ЗаполнитьКраткийСоставСотрудников(НоваяСтрока);
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	Если Объект.Комиссия.Количество() = 0 Тогда
		Объект.Комиссия.Загрузить(РезультатыЗапроса.Получить(РезультатыЗапроса.ВГраница()-2).Выгрузить());
		Если Объект.Комиссия.Количество() = 0 Тогда
			Если ЗначениеЗаполнено(Объект.Руководитель) Тогда
				НоваяСтрокаКомиссии = Объект.Комиссия.Добавить();
				НоваяСтрокаКомиссии.ЧленКомиссии = Объект.Руководитель;
				НоваяСтрокаКомиссии.Должность = Объект.ДолжностьРуководителя;
				НоваяСтрокаКомиссии.РольВКомиссии = Перечисления.РолиЧленовКомиссииОхраныТруда.Председатель;
			КонецЕсли;
			Если ЗначениеЗаполнено(Объект.ОтветственныйЗаОхрануТруда) Тогда
				НоваяСтрокаКомиссии = Объект.Комиссия.Добавить();
				НоваяСтрокаКомиссии.ЧленКомиссии = Объект.ОтветственныйЗаОхрануТруда;
				НоваяСтрокаКомиссии.Должность = Объект.ДолжностьОтветственногоЗаОхрануТруда;
				НоваяСтрокаКомиссии.РольВКомиссии = Перечисления.РолиЧленовКомиссииОхраныТруда.ЧленКомиссии;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьМассивАналогичныхРабочихМест(СтрокаРабочегоМеста)
	
	МассивАналогичныхМестПриемник = Новый Массив;
	
	НайденныеСтроки = Объект.АналогичныеМеста.НайтиСтроки(
		Новый Структура("ИдентификаторСтрокиРабочегоМеста", СтрокаРабочегоМеста.ИдентификаторСтрокиРабочегоМеста));
	
	Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл 
		МассивАналогичныхМестПриемник.Добавить(НайденнаяСтрока.АналогичноеМесто);
	КонецЦикла;
	
	СтрокаРабочегоМеста.МассивАналогичныхРабочихМест = Новый ФиксированныйМассив(МассивАналогичныхМестПриемник);
	ЗаполнитьКраткийСоставАналогичныхМест(СтрокаРабочегоМеста)
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьМассивСотрудников(СтрокаРабочегоМеста)
	
	СотрудникиНаРабочемМесте = Новый Массив;
	
	НайденныеСтроки = Объект.Сотрудники.НайтиСтроки(
		Новый Структура("ИдентификаторСтрокиРабочегоМеста", СтрокаРабочегоМеста.ИдентификаторСтрокиРабочегоМеста));
	
	Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл 
		Описание = ОписаниеСтрокиСотрудника();
		ЗаполнитьЗначенияСвойств(Описание, НайденнаяСтрока);
		СотрудникиНаРабочемМесте.Добавить(Описание);
	КонецЦикла;
	
	СтрокаРабочегоМеста.МассивСотрудников = Новый ФиксированныйМассив(СотрудникиНаРабочемМесте);
	ЗаполнитьКраткийСоставСотрудников(СтрокаРабочегоМеста);
	
КонецПроцедуры

&НаСервере
Процедура ДополнитьМассивСотрудников(СтрокаРабочегоМеста, ДанныеДляДополнения)
	
	Описание = ОписаниеСтрокиСотрудника();
	ЗаполнитьЗначенияСвойств(Описание, ДанныеДляДополнения);
	
	МассивСотрудниковПриемник = Новый Массив(СтрокаРабочегоМеста.МассивСотрудников);
	МассивСотрудниковПриемник.Добавить(Описание);
	СтрокаРабочегоМеста.МассивСотрудников = Новый ФиксированныйМассив(МассивСотрудниковПриемник);
	
КонецПроцедуры

&НаСервере
Процедура РабочиеМестаРабочееМестоПриИзмененииНаСервере(ИдентификаторСтроки, Знач ТекущаяСтрока = Неопределено, ДополнятьАналогичнымиМестами = Ложь)
	
	Если ТекущаяСтрока = Неопределено Тогда
		ТекущаяСтрока = Объект.РабочиеМеста.НайтиПоИдентификатору(ИдентификаторСтроки);
	Иначе
		ТекущаяСтрока.Подразделение = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекущаяСтрока.РабочееМесто, "Подразделение");
		ТекущаяСтрока.Должность = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекущаяСтрока.РабочееМесто, "Должность");
	КонецЕсли;
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	ПараметрыПолученияСотрудниковОрганизаций = КадровыйУчет.ПараметрыПолученияСотрудниковОрганизацийПоСпискуФизическихЛиц();
	СтруктураРабочегоМеста = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ТекущаяСтрока.РабочееМесто, "Владелец, Подразделение");
	ПараметрыПолученияСотрудниковОрганизаций.Организация = СтруктураРабочегоМеста.Владелец;
	ПараметрыПолученияСотрудниковОрганизаций.Подразделение = СтруктураРабочегоМеста.Подразделение;
	ПараметрыПолученияСотрудниковОрганизаций.НачалоПериода = Объект.ДатаНачала;
	ПараметрыПолученияСотрудниковОрганизаций.ОкончаниеПериода = Объект.ДатаОкончания;
	
	КадровыйУчет.СоздатьВТСотрудникиОрганизации(Запрос.МенеджерВременныхТаблиц, Истина, ПараметрыПолученияСотрудниковОрганизаций);
	
	ОписательВременныхТаблиц = КадровыйУчет.ОписательВременныхТаблицДляСоздатьВТКадровыеДанныеСотрудников(
			Запрос.МенеджерВременныхТаблиц, "ВТСотрудникиОрганизации");
	КадровыеДанные = "РабочееМестоОхраныТруда, Пол, ДатаРождения, Инвалидность, СтраховойНомерПФР";
	КадровыйУчет.СоздатьВТКадровыеДанныеСотрудников(ОписательВременныхТаблиц, Истина, КадровыеДанные);
	
	РабочиеМеста = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ТекущаяСтрока.РабочееМесто);
	
	Если ДополнятьАналогичнымиМестами Тогда
		Для Каждого АналогичноеМесто Из ТекущаяСтрока.МассивАналогичныхРабочихМест Цикл
			РабочиеМеста.Добавить(АналогичноеМесто);
		КонецЦикла;
	КонецЕсли;
	
	Запрос.УстановитьПараметр("РабочееМесто", ТекущаяСтрока.РабочееМесто);
	Запрос.УстановитьПараметр("РабочиеМеста", РабочиеМеста);
	Запрос.УстановитьПараметр("ДатаДокумента", Объект.Дата);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РезультатыСпециальнойОценкиУсловийТруда.Период,
	|	РезультатыСпециальнойОценкиУсловийТруда.РабочееМесто,
	|	РезультатыСпециальнойОценкиУсловийТруда.КлассУсловийТруда
	|ИЗ
	|	РегистрСведений.РезультатыСпециальнойОценкиУсловийТруда.СрезПоследних(&ДатаДокумента, РабочееМесто = &РабочееМесто) КАК РезультатыСпециальнойОценкиУсловийТруда";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ТекущаяСтрока.КлассУсловийТрудаПоРезультатамПредыдущейОценки = Выборка.КлассУсловийТруда;
		ТекущаяСтрока.ДатаПредыдущейОценки = Выборка.Период;
	КонецЦикла;
	
	ТекущаяСтрока.МассивСотрудников = Новый ФиксированныйМассив(Новый Массив());
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КадровыеДанныеСотрудников.Сотрудник,
	|	КадровыеДанныеСотрудников.РабочееМестоОхраныТруда КАК РабочееМесто,
	|	КадровыеДанныеСотрудников.Пол,
	|	КадровыеДанныеСотрудников.ДатаРождения,
	|	КадровыеДанныеСотрудников.Инвалидность,
	|	КадровыеДанныеСотрудников.СтраховойНомерПФР
	|ИЗ
	|	ВТКадровыеДанныеСотрудников КАК КадровыеДанныеСотрудников
	|ГДЕ
	|	КадровыеДанныеСотрудников.РабочееМестоОхраныТруда В (&РабочиеМеста)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ДополнитьМассивСотрудников(ТекущаяСтрока, Выборка)
	КонецЦикла;
	
	ЗаполнитьКраткийСоставАналогичныхМест(ТекущаяСтрока);
	ЗаполнитьКраткийСоставСотрудников(ТекущаяСтрока);
	
КонецПроцедуры

&НаСервере
Функция ДолжностьЧленаКомиссии(ЧленКомиссии)
	
	ТаблицаСотрудников = КадровыйУчет.ОсновныеСотрудникиФизическихЛиц(ЧленКомиссии, Истина, Объект.Организация, Объект.ДатаНачала);
	Сотрудники = ТаблицаСотрудников.ВыгрузитьКолонку("Сотрудник");
	КадровыеДанные = КадровыйУчет.КадровыеДанныеСотрудников(Истина, Сотрудники, "ТекущаяДолжность", Объект.ДатаНачала);
	
	Если КадровыеДанные.Количество() > 0 Тогда
		ТекущаяДолжность = КадровыеДанные[0].ТекущаяДолжность;
		Если ЗначениеЗаполнено(ТекущаяДолжность) Тогда
			Возврат ТекущаяДолжность;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

&НаКлиенте
Процедура ОткрытьФормуАналогичныхРабочихМестПоСтроке(ТекущиеДанные, ЭтоКомандаВыделение = Ложь)
	
	МассивАналогичныеМеста = Новый Массив();
	
	Если Не ТекущиеДанные.МассивАналогичныхРабочихМест = Неопределено Тогда
		Для Каждого РабочееМесто Из ТекущиеДанные.МассивАналогичныхРабочихМест Цикл
			МассивАналогичныеМеста.Добавить(РабочееМесто);
		КонецЦикла;
	КонецЕсли;
	
	МассивРабочиеМеста = Новый Массив;
	Описание = ОписаниеРабочегоМеста();
	ЗаполнитьЗначенияСвойств(Описание, ТекущиеДанные);
	Для Каждого СтрокаРабочиеМеста Из Объект.РабочиеМеста.НайтиСтроки(Описание) Цикл
		Если СтрокаРабочиеМеста.ИдентификаторСтрокиРабочегоМеста = ТекущиеДанные.ИдентификаторСтрокиРабочегоМеста Тогда
			// Текущую строку не добавляем в доступные рабочие места
			Продолжить;
		КонецЕсли;
		МассивРабочиеМеста.Добавить(Новый Структура("РабочееМесто", СтрокаРабочиеМеста.РабочееМесто));
	КонецЦикла;
	
	Если МассивАналогичныеМеста.Количество() = 0 И МассивРабочиеМеста.Количество() = 0 Тогда
		Если Не ЭтоКомандаВыделение Тогда
			ВызватьИсключение НСтр("ru = 'Не удалось выделить аналогичные рабочие места: в табличной части нет рабочих мест с такими же подразделением и должностью.'");
		КонецЕсли;
		Возврат;	
	КонецЕсли;
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("АналогичныеМеста", МассивАналогичныеМеста);
	ПараметрыОткрытия.Вставить("РабочиеМеста", МассивРабочиеМеста);
	ПараметрыОткрытия.Вставить("ОсновноеРабочееМесто", ТекущиеДанные.РабочееМесто);
	ПараметрыОткрытия.Вставить("ТолькоПросмотр", ТолькоПросмотр);
	
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ВыделитьАналогичныеРабочиеМестаПослеЗакрытия", ЭтотОбъект);
	ОткрытьФорму("Документ.ПодготовкаСпецоценкиУсловийТруда.Форма.ФормаАналогичныхМест",
		ПараметрыОткрытия, ЭтотОбъект, , , , ОповещениеОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ОписаниеРабочегоМеста()
	
	Описание = Новый Структура(
		"Подразделение,
		|Должность");
	
	Возврат Описание;
	
КонецФункции

&НаСервере
Процедура РабочиеМестаПередУдалениемНаСервере(ИдентификаторСтрокиРабочегоМеста)
	
	СтруктураПоиска = Новый Структура("ИдентификаторСтрокиРабочегоМеста", ИдентификаторСтрокиРабочегоМеста);
	НайденныеСтроки = Объект.АналогичныеМеста.НайтиСтроки(СтруктураПоиска);
	Для каждого НайденнаяСтрока Из НайденныеСтроки Цикл
		Объект.АналогичныеМеста.Удалить(НайденнаяСтрока);
	КонецЦикла;
	
	НайденныеСтроки = Объект.Сотрудники.НайтиСтроки(СтруктураПоиска);
	Для каждого НайденнаяСтрока Из НайденныеСтроки Цикл
		Объект.Сотрудники.Удалить(НайденнаяСтрока);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура РабочиеМестаОбработкаВыбораНаСервере(ВыбранныеСотрудники)
	
	Если ТипЗнч(ВыбранныеСотрудники) = Тип("СправочникСсылка.Сотрудники") Тогда
		ВыбранныеСотрудники = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ВыбранныеСотрудники);
	КонецЕсли;
	
	СуществующиеСотрудники = Новый Массив();
	Для Каждого СтрокаРабочегоМеста Из Объект.РабочиеМеста Цикл
		Для Каждого СтрокаСотрудника Из СтрокаРабочегоМеста.МассивСотрудников Цикл
			СуществующиеСотрудники.Добавить(СтрокаСотрудника.Сотрудник);
		КонецЦикла;
	КонецЦикла;
	
	КадровыеДанныеСотрудников = КадровыйУчет.КадровыеДанныеСотрудников(
		Истина,
		ОбщегоНазначенияКлиентСервер.РазностьМассивов(ВыбранныеСотрудники, СуществующиеСотрудники),
		"РабочееМестоОхраныТруда,Должность,Подразделение,Пол,ДатаРождения,Инвалидность,СтраховойНомерПФР",
		?(ЗначениеЗаполнено(Объект.ДатаОкончания), Объект.ДатаОкончания, Объект.ДатаНачала));
	
	Для каждого ДанныеСотрудника Из КадровыеДанныеСотрудников Цикл
		СтрокиРабочегоМеста = Объект.РабочиеМеста.НайтиСтроки(Новый Структура("РабочееМесто,Должность,Подразделение",
			ДанныеСотрудника.РабочееМестоОхраныТруда, ДанныеСотрудника.Должность, ДанныеСотрудника.Подразделение));
		Если СтрокиРабочегоМеста.Количество() > 0 Тогда
			СтрокаРабочегоМеста = СтрокиРабочегоМеста[0];
			Если Не ЗначениеЗаполнено(СтрокаРабочегоМеста.РабочееМесто) Тогда
				СтрокаРабочегоМеста = Объект.РабочиеМеста.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаРабочегоМеста, ДанныеСотрудника);
				СтрокаРабочегоМеста.РабочееМесто = ДанныеСотрудника.РабочееМестоОхраныТруда;
				МаксимальныйИдентификаторСтрокиРабочегоМеста = МаксимальныйИдентификаторСтрокиРабочегоМеста + 1;
				СтрокаРабочегоМеста.ИдентификаторСтрокиРабочегоМеста = МаксимальныйИдентификаторСтрокиРабочегоМеста;
				СтрокаРабочегоМеста.МассивАналогичныхРабочихМест = Новый ФиксированныйМассив(Новый Массив());
				СтрокаРабочегоМеста.МассивСотрудников = Новый ФиксированныйМассив(Новый Массив());
			КонецЕсли;
		Иначе
			СтрокаРабочегоМеста = Объект.РабочиеМеста.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаРабочегоМеста, ДанныеСотрудника);
			СтрокаРабочегоМеста.РабочееМесто = ДанныеСотрудника.РабочееМестоОхраныТруда;
			МаксимальныйИдентификаторСтрокиРабочегоМеста = МаксимальныйИдентификаторСтрокиРабочегоМеста + 1;
			СтрокаРабочегоМеста.ИдентификаторСтрокиРабочегоМеста = МаксимальныйИдентификаторСтрокиРабочегоМеста;
			СтрокаРабочегоМеста.МассивАналогичныхРабочихМест = Новый ФиксированныйМассив(Новый Массив());
			СтрокаРабочегоМеста.МассивСотрудников = Новый ФиксированныйМассив(Новый Массив());
		КонецЕсли;
		ДополнитьМассивСотрудников(СтрокаРабочегоМеста, ДанныеСотрудника);
		ЗаполнитьКраткийСоставАналогичныхМест(СтрокаРабочегоМеста);
		ЗаполнитьКраткийСоставСотрудников(СтрокаРабочегоМеста);
	КонецЦикла;
	
	Объект.РабочиеМеста.Сортировать("Подразделение,Должность");
	
КонецПроцедуры

&НаСервере
Функция АдресСпискаПодобранныхСотрудников()
	
	МассивСотрудников = Новый Массив;
	
	Для Каждого СтрокаРабочегоМеста Из Объект.РабочиеМеста Цикл
		Для Каждого СтрокаСотрудника Из СтрокаРабочегоМеста.МассивСотрудников Цикл
			МассивСотрудников.Добавить(СтрокаСотрудника.Сотрудник);
		КонецЦикла;
	КонецЦикла;
	
	Возврат ПоместитьВоВременноеХранилище(МассивСотрудников, УникальныйИдентификатор);
	
КонецФункции

&НаСервереБезКонтекста
Функция КраткийСоставСотрудников(МассивДанныхСотрудников, Дата)
	
	МассивСотрудников = Новый Массив;
	
	Для Каждого ДанныеСотрудника Из МассивДанныхСотрудников Цикл
		МассивСотрудников.Добавить(ДанныеСотрудника.Сотрудник);
	КонецЦикла;
	
	Возврат ЗарплатаКадры.КраткийСоставСотрудников(МассивСотрудников, Дата);
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ОписаниеСтрокиСотрудника()
	
	Описание = Новый Структура(
		"Сотрудник,
		|РабочееМесто,
		|СтраховойНомерПФР,
		|Пол,
		|ДатаРождения,
		|Инвалидность");
	
	Возврат Описание;
	
КонецФункции

#Область КлючевыеРеквизитыЗаполненияФормы

&НаСервере
// Функция возвращает описание таблиц формы подключенных к механизму ключевых реквизитов формы.
Функция КлючевыеРеквизитыЗаполненияФормыТаблицыОчищаемыеПриИзменении() Экспорт
	
	Массив = Новый Массив;
	Массив.Добавить("Объект.РабочиеМеста");
	Массив.Добавить("Объект.АналогичныеМеста");
	Массив.Добавить("Объект.Сотрудники");
	
	Возврат Массив;
	
КонецФункции

&НаСервере
// Функция возвращает массив реквизитов формы подключенных к механизму ключевых реквизитов формы.
Функция КлючевыеРеквизитыЗаполненияФормыОписаниеКлючевыхРеквизитов() Экспорт
	
	Массив = Новый Массив;
	Массив.Добавить(Новый Структура("ЭлементФормы, Представление", "Организация", 		НСтр("ru = 'организации'")));
	Массив.Добавить(Новый Структура("ЭлементФормы, Представление", "Подразделение", 	НСтр("ru = 'подразделения'")));
	
	Возврат Массив;
	
КонецФункции

#КонецОбласти

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '< Спецоценка не проводилась >'"));
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ТекстЗапрещеннойЯчейкиЦвет);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
		ЭлементУсловногоОформления.Отбор,
		"Объект.РабочиеМеста.КлассУсловийТрудаПоРезультатамПредыдущейОценки",, ВидСравненияКомпоновкиДанных.НеЗаполнено);
	ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("РабочиеМестаКлассУсловийТрудаПоРезультатамПредыдущейОценки");

	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '< Не назначено >'"));
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ТекстЗапрещеннойЯчейкиЦвет);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
		ЭлементУсловногоОформления.Отбор, "Объект.РабочиеМеста.РабочееМесто",, ВидСравненияКомпоновкиДанных.НеЗаполнено);
	ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("РабочиеМестаРабочееМесто");

КонецПроцедуры

#КонецОбласти
